<html>
<head>
<title>Ajuda do Notes - Introdu&ccedil;&atilde;o</title>
<link rel="stylesheet" href="help.css" type="text/css">
<meta name="generator" content="Notes, https://github.com/jonasraoni/notes">
</head>
<body bgcolor="#ffffff" text="#000000">

<table class="header" width="100%">
  <tr>
    <td>
      <h1>Ajuda do Notes - Introdu&ccedil;&atilde;o</h1>
    </td>
    <td>
      <div style="text-align: right;" class="header">
        <a href="intro-what.htm">&lt; Anterior</a> |
        <a href="index.htm">&Iacute;ndice</a> |
        <a href="intro-devsoftware.htm">Pr&oacute;xima &gt;</a>
      </div>
    </td>
  </tr>
</table>

<h2>Conceitos b&aacute;sicos</h2>
<br>
<h3>A interface</h3>
O Notes é composto por uma interface bastante semelhante
a de outros programas. Os elementos da interface
que você já deve conhecer bem são o menu, a barra de ferramentas
e a barra de status. Além deles, o Notes tem uma série de
tabs e painéis.
<br><br>
<b>Tabs</b> (também chamadas de "abas") cont&eacute;m normalmente um
editor onde voc&ecirc; pode editar um arquivo. As tabs podem tamb&eacute;m
conter a StartPage e outros elementos. Esta disposi&ccedil;&atilde;o em tabs permite
que voc&ecirc; edite centenas de arquivos em apenas uma janela do Notes.
<br><br>
<b>Pain&eacute;is</b> s&atilde;o pequenas janelas que aparecem a esquerda, direita
ou em baixo da &aacute;rea das tabs. Voc&ecirc; pode mostrar/esconder os pain&eacute;is clicando
no pequeno bot&atilde;o com uma flecha no centro que aparece na linha que separa
os pain&eacute;is do editor. Os pain&eacute;is tamb&eacute;m s&atilde;o dispostos em tabs (abas). Voc&ecirc;
pode mudar um painel de lugar clicando com o bot&atilde;o direito do mouse na tab
do painel e escolhendo no menu de contexto a nova localiza&ccedil;&atilde;o.
<br><br>

<h3>Tipos de arquivos</h3>
Como j&aacute; foi dito, o Notes n&atilde;o conhece nenhuma linguagem por padr&atilde;o. Tipos de
arquivo s&atilde;o um conjunto de arquivos que fazem o Notes reconhecer uma linguagem,
colorir a sua sintaxe, oferecer uma biblioteca de c&oacute;digos para ele, identar
o seu c&oacute;digo, etc. Exemplo de tipos de aqruivo s&atilde;o ASP, HTML, Delphi, C-C++,
CSS, etc.<br><br>

<h3>Profiles</h3>
O Notes guarda <i>todas</i> as suas configura&ccedil;&otilde;es dentro de um profile. Um
profile &eacute; como um grupo de configura&ccedil;&otilde;es que s&atilde;o mantidas juntas. Voc&ecirc; pode
ter v&aacute;rios profiles: um para criar webpages, outro para programa em Java,
outro para escrever XML, etc. Claro, voc&ecirc; pode fazer tudo isto com um
profile s&oacute;, mas usando profile voc&ecirc; pode escolher configura&ccedil;&otilde;es que
funcionem melhor para certos tipos de trabalhos. O Notes precisa de ao
menos um profile para funcionar, j&aacute; que &eacute; o profile que comanda o funcionamento
do Notes. Durante a instala&ccedil;&atilde;o o Notes cria um profile padr&atilde;o. Voc&ecirc; pode
gerenciar os profiles em Op&ccedil;&otilde;es &gt;&gt; Configurar Profiles.
<br><br>

</body>
</html>
