<html>
<head>
<title>Ajuda do Notes - Introdu&ccedil;&atilde;o</title>
<link rel="stylesheet" href="help.css" type="text/css">
<meta name="generator" content="Notes, https://github.com/jonasraoni/notes">
</head>
<body bgcolor="#ffffff" text="#000000">

<table class="header" width="100%">
  <tr>
    <td>
      <h1>Ajuda do Notes - Introdu&ccedil;&atilde;o</h1>
    </td>
    <td>
      <div style="text-align: right;" class="header">
        <a href="intro-devsoftware.htm">&lt; Anterior</a> |
        <a href="index.htm">&Iacute;ndice</a> |
        <a href="prog-intro.htm">Pr&oacute;xima &gt;</a>
      </div>
    </td>
  </tr>
</table>

<h2>Criando Websites</h2>
<br>
O Notes traz grandes facilidades para quem quer criar websites em HTML, ASP .Net,
PHP, Perl, etc. A primeira coisa que voc&ecirc; vai querer fazer &eacute; configurar o Notes
para <a href="tools-browser.htm">fazer preview dos sites que voc&ecirc; desenvolve</a>.
<br><br>

O Notes possu&iacute; um editor cheio de features para ajud&aacute;-lo a criar websites.
O Notes pode fechar tags automaticamente, identar o c&oacute;digo, colorir a sintaxe,
etc. Veja mais sobre sobre <a href="prog-codeediting.htm">edi&ccedil;&atilde;o de arquivos
aqui</a>. Voc&ecirc; deve olhar tamb&eacute;m o menu &quot;Comandos&quot;. Ele possu&iacute; comandos para
veririficar HTML e coverter HTML para XHTML usando o
<a href="http://tidy.sf.net">HTMLTidy</a>, converter carateres especiais (como
letras com acentua&ccedil;&atilde;o) para os c&oacute;digos especiais do HTML, etc. Outra coisa
que provavelmente voc&ecirc; achar&aacute; muito &uacute;til &eacute; o suporte a quebra autom&aacute;tica
de linhas (WordWrap) que pode ser ativado no menu &quot;op&ccedil;&otilde;es&quot;.
<br><br>

Se voc&ecirc; programa para web, voc&ecirc; sabe (ou ao menos deveria saber) programar em
JavaScript. A grande not&iacute;cia &eacute; que o Notes pode executar <a href="macros-intro.htm">macros</a>
escritas em JavaScript, isto &eacute;, voc&ecirc; pode criar novos comandos e adicionar novas
funcionalidades ao Notes usando uma linguagem que voc&ecirc; j&aacute; conhece.
<br><br>

Outra coisa que voc&ecirc; vai gostar muito &eacute; a biblioteca do Notes. O Notes possu&iacute; uma
bblioteca de c&oacute;digos para cada uma das linguagems de programa&ccedil;&atilde;o. A biblioteca
de HTML &eacute; uma das mais completas. Voc&ecirc; pode acessar a biblioteca atrav&eacute;s do
painel biblioteca. No painel voc&ecirc; pode usar o menu de contexto dele (clicando
com o bot&atilde;o direito do mouse) para criar novos items, deletar items, etc. Al&eacute;m
da biblioteca, o Notes tamb&eacute;m possu&iacute; suporte a Templates. De fato, o Notes sempre
cria novos arquivos atrav&eacute;s de templates, como voc&ecirc; j&aacute; deve ter percebido ao
usar o di&aacute;logo para novos arquivos. Voc&ecirc; pode <a href="config-templates.htm">criar os seus
pr&oacute;prios templates</a> para os sites que voc&ecirc; est&aacute; desenvolvendo.
<br><br>

</body>
</html>
