<html>
<head>
<title>Ajuda do Notes - Programando</title>
<link rel="stylesheet" href="help.css" type="text/css">
<meta name="generator" content="Notes, https://github.com/jonasraoni/notes">
</head>
<body bgcolor="#ffffff" text="#000000">

<table class="header" width="100%">
  <tr>
    <td>
      <h1>Ajuda do Notes - Programando</h1>
    </td>
    <td>
      <div style="text-align: right;" class="header">
        <a href="prog-intro.htm">&lt; Anterior</a> |
        <a href="index.htm">&Iacute;ndice</a> |
        <a href="prog-codeediting.htm">Pr&oacute;xima &gt;</a>
      </div>
    </td>
  </tr>
</table>

<h2>Formatando e identando</h2>
<br>
<h3>Formatando</h3>
&Eacute; normal recebermos c&oacute;digo mal formatado ou cometermos erros de formata&ccedil;&atilde;o.
Por isso o Notes traz comandos para ajud&aacute;-lo a corrigir a formata&ccedil;&atilde;o. Estes
comandos est&atilde;o em Editar &gt;&gt; Formatar. Eles permitem alterar o texto para
mais&uacute;sculas, min&uacute;sculas, deixar a primeira letra de cada palavra em mai&uacute;scula
e inverter entre mai&uacute;sculas e min&uacute;sculas. Outros comandos dispon&iacute;veis s&atilde;o
os que convertem os espa&ccedil;os selecionados para tabs e vice-versa. Esta convers&atilde;o
&eacute; feita com base nas suas configura&ccedil;&otilde;es. Por exemplo, se as suas op&ccedil;&otilde;es
dizem que o caracter TAB tem o tamanho de 4 espa&ccedil;os, ao converter um trecho
que tem 8 espa&ccedil;os o Notes vai substituir os 8 espa&ccedil;os por 2 caracteres tabs.
<br><br>

<h3>Identando</h3>
Uma das preocupa&ccedil;os dos programadores &eacute; manter o c&oacute;digo bem identando. C&oacute;digo
mal identando dificulta a redabilidade do c&oacute;digo e sempre acaba levando ao
aparecimento de bugs. No menu editar existem tr&ecirc;s comandos que ajudam a corrigir
a identa&ccedil;&atilde;o do c&oacute;digo: &quot;reidentar bloco&quot;, &quot;aumentar a identa&ccedil;&atilde;o&quot; e &quot;diminuir
a identa&ccedil;&atilde;o&quot;. Estes comandos fazem extamente o que dizem de acordo com as
suas configura&ccedil;&otilde;es atuais. O comando reidentar bloco usa as regras da engine
de SmartIdent para reidentar o trecho selecionado ou a linha atual. Os outros
dois comandos aumentam/diminuem a identa&ccedil;&atilde;o do trecho selecionado ou da linha
atual. <br>
<br>
O Notes pode tamb&eacute;m ajud&aacute;-lo a identar o c&oacute;digo enquanto voc&ecirc; digita. Para isto
voc&ecirc; deve ter a op&ccedil;&atilde;o SmartIndent ativada para a linguagem que voc&ecirc; est&aacute;
identando. Quando ela esta ativada o Notes vai aumentar e diminuir a identa&ccedil;&atilde;o
com base na &uacute;ltima linha de c&oacute;digo. Por exemplo, em C/C++/Java ele vai aumentar
a identa&ccedil;&atilde;o quando a linha anterior terminar com &quot;{&quot;. As regras do SmartIndent
s&atilde;o <a href="customize-smartindent.htm">customiz&aacute;veis</a>, voc&ecirc; pode alter&aacute;-las para que
fiquem de acordo com o modo que voc&ecirc; gosta de identar o c&oacute;digo. Se
você não gostar do SmartIndent, você pode usar também o AutoIndent que apenas mantém
a identação quando uma nova linha é criada. Tudo isto pode ser configurado no
diálogo de preferências dentro da aba "editor".
<br><br>

</body>
</html>
