<html>
<head>
<title>Ajuda do Notes - Programando</title>
<link rel="stylesheet" href="help.css" type="text/css">
<meta name="generator" content="Notes, https://github.com/jonasraoni/notes">
</head>
<body bgcolor="#ffffff" text="#000000">

<table class="header" width="100%">
  <tr>
    <td>
      <h1>Ajuda do Notes - Programando</h1>
    </td>
    <td>
      <div style="text-align: right;" class="header">
        <a href="intro-webdev.htm">&lt; Anterior</a> |
        <a href="index.htm">&Iacute;ndice</a> |
        <a href="prog-formatindent.htm">Pr&oacute;xima &gt;</a>
      </div>
    </td>
  </tr>
</table>

<h2>Introdução</h2>
<br>
As fun&ccedil;&otilde;es b&aacute;sicas de edi&ccedil;&atilde;o do Notes funcionam como na maioria dos editores.
Voc&ecirc; pode copiar, recortar e colar da &aacute;rea de transfer&ecirc;ncia, deletar e selecionar
texto, etc. Por&eacute;m o Notes possu&iacute; algumas capacidades que outros editores n&atilde;o
possuem.<br><br>

<h3>Deletar, selecionar e duplicar linhas</h3>
O Notes pode deletar, selecionar e duplicar linhas inteiras com apenas um comando.
Estes comandos ficam em editar &gt;&gt; Linha.
<br><br>

<h3>Seleção de colunas</h3>
Voc&ecirc; pode selecionar colunas de texto ao inv&eacute;s de usar a sele&ccedil;&atilde;o normal. Para
ativar a sele&ccedil;&atilde;o de colunas, v&aacute; em Editar &gt;&gt; Sele&ccedil;&atilde;o de Colunas. Voc&ecirc; tamb&eacute;m
pode fazer sele&ccedil;&otilde;es de colunas r&aacute;pidas mantendo a tecla ALT pressionada e
usando ent&atilde;o o mouse para selecionar.
<br><br>

<h3>Outros comandos avançados</h3>
O Notes suportar drag and drop de textos. Para mover um peda&ccedil;o de texto para
outro lugar, selecione o trecho e depois segure-o com o mouse e arraste
para o local desejado. Voc&ecirc; pode tamb&eacute;m copiar o texto ao inv&eacute;s de mover
segurando a tecla control (Ctrl) enquanto arrasta o texto. Outro comando
muito &uacute;til est&aacute; em editar &gt;&gt; adicionar a clipboard. Ele adiciona o texto
a &aacute;rea de transfer&ecirc;ncia. Digamos que voc&ecirc; queira copiar para outro texto
duas partes do documento atual. Para isto voc&ecirc; pode copiar o primeiro trecho
do texto e depois usar &quot;adicionar a clipboard&quot; para adionar o segundo trecho.
Quando voc&ecirc; usar o comando &quot;colar&quot;, os dois trechos ser&atilde;o colados. O Notes
disp&otilde;es ainda de mais comandos de edi&ccedil;&atilde;o que podem ser acionados apenas
por teclas de atalho - voc&ecirc; pode ver estes comandos indo em Op&ccedil;&otilde;es &gt;&gt;
Configurar teclas de atalho.
<br><br>


</body>
</html>
